using System;
using System.Collections.Generic;
using System.Linq;
using System.Web;
using System.Web.Mvc;
using Teeba.Models;

namespace Teeba.Controllers
{
    public class HomeController : Controller
    {
        ApplicationDbContext context = new ApplicationDbContext();

        public ActionResult Index()
        {
            var tour = context.Tours.FirstOrDefault(m => m.ID == 5);
            var tour2 = context.Tours.FirstOrDefault(m => m.ID == 7);
            tour.Image = "Karnak6.jpg";
            tour2.Image = "AbuSimble2.jpg";
            context.SaveChanges();
            return View();
        }
        //public ActionResult TranslateLuxor()
        //{
        //    return Content("الأقصر تلقب بمدينة المائة باب أو مدينة الشمس، عُرفت سابقاً باسم طيبة، هي عاصمة مصر في العصر الفرعوني، تقع على ضفاف نهر النيل والذي يقسمها إلى شطرين البر الشرقي والبر الغربي , يرجع تأسيس مدينة طيبة إلى عصر الأسرة الرابعة حوالي عام 2575 ق.م" + "<br />" +
        //        "مدينة الأقصر، أو مدينة الحضارة ، أو المعبد المفتوح تعد من أهم مدن السياحة في مصر على الإطلاق، فهي قديمة قدم التاريخ نفسه."+ "<br />" +
        //        "أينما تذهب في الأقصر ستجد آثراً ناطقاً بحضارة عظيمة، ولما لا؟ وهي “طيبة” عاصمة الدولة الفرعونية القديمة، وبها أهم المعابد والآثار الفرعونية" +
        //        " مدينة الاقصر مدينة الأقصر لا تجتذب هواة الثقافة والتاريخ فقط لإرثها الحضاري الهائل، ولكنها في الوقت ذاته تقدم للسياح الكثير من المفاجآت، أبرزها رحلات الكروز في الأقصر على نهر النيل الذي يشطرها إلى نصفين، والاستمتاع بأجمل المناظر الطبيعية الخلابة، وكذلك رحلات البالون الطائر التي تمنحك أجمل إطلالة على المدينة من الأعلى، ولا ننسى بالطبع ركوب الحنطور، وسيلة التنقل الأشهر في الأقصر، وفوق كل ذلك المناخ المعتدل شتاءً، الذي جعل الأقصر مشتى عالمي لا يوجد له مثيل له.");
        //}
        //public ActionResult TranslateAswan()
        //{
        //    return Content("يقبل الزوار على السياحة في مصر منذ عقودٍ بعيدةٍ، حيث منحها موقعها المتميز وتلاقي قارات العالم القديم آسيا وأفريقيا وأوروبا عن طريقها، وإذا قلنا إن مصر بها اثار لا حصر لها، فإن السياحة في أسوان تضم الكثير من هذه المعالم وما هو أكثر من الآثار التاريخية." + "<br />" +
        //        "اعتبرت أسوان تاريخيًا إحدى أهم مدن جنوب مصر والبوابة الجنوبية لها، حيث يقع إلى الجنوب منها الشلال الأول لنهر النيل والذي مَثَّل حدًا طبيعيًا بين صعيد مصر والنوبة" + "<br />" +
        //        "مدينة أسوان وعلى الرغم من أن معالم مصر القديمة تختلف اختلافاً تاماً عن أي آثارٍ تاريخيةٍ في العالم كله، فهي ليست بقايا مبانٍ أو قصورٍ أو معابد، بل أنها حضارةٌ كاملةً ما زالت معابدها بكامل رونقها وبهائها." + "<br />" +
        //        "السياحة في أسوان ليست فقط أثارٌ قديمةٌ، لكن يوجد الكثير من معالم أسوان الهامة، وتعتبر شمس أسوان الساطعة أهم معالم تلك المدينة الساحرة حيث يفد إليها سياح أوروبا التماساً للدفء من صقيع بلادهم في فصل الشتاء، وأيضاً تنتعش السياحة العلاجية في أسوان وكذلك الترفيهية، وفيها المحميات الطبيعية والمناظر الخلابة، والشلالات العظيمة وأيضا السد العالي رمز كفاح ونجاح الشعب المصري من أجل التنمية والرخاء، علاوة على رحلات الكروز في أسوان.");
        //}
        public ActionResult Contact()
        {
            return View();
        }
        public ActionResult ErrorPageNotFound()
        {
            return View();
        }
    }
}